ПергамПереводРасширенияНаАнглийский/src/ExternalDataProcessors/ПергамПереводРасширенияНаАнглийский/ПергамПереводРасширенияНаАнглийский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ПергамПереводРасширенияНаАнглийский</name>
  <attributes>
    <name>ПутьКРасширению</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Результат</name>
    <attributes>
      <name>ПутьКРеквизиту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРусское</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеАнглийское</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

ПергамПереводРасширенияНаАнглийский/src/ExternalDataProcessors/ПергамПереводРасширенияНаАнглийский/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПрочитатьФайл(Команда)
#Если не ВебКлиент тогда
	//TODO: Заменить присваивание на перебор файлов
	//отладка
	//ИмяФайлаХМЛ = Объект.ПутьКРасширению;
	Лимит = 10000;
	ИмяФайлаХМЛ = "D:\test\1\Documents\ПоступлениеТоваровУслуг\Forms\ФормаДокумента\Ext\Form.xml";
	//TODO: Вставить код чтения ХМЛ
	Ф = Новый ЧтениеXML();
	ф.ИгнорироватьПробелы = истина;
	ф.ОткрытьФайл(ИмяФайлаХМЛ);
	ОбработаноАтрибутов = 0;
	Пока ф.Прочитать() цикл
		Если ф.ТипУзла = ТипУзлаXML.НачалоЭлемента тогда
			ИмяАтрибута = ф.ЗначениеАтрибута("name");
			ТипАтрибута = ""+Ф.Имя;
			Если НЕ ИмяАтрибута = Неопределено тогда
				ИмяАтрибутаСт = ИмяАтрибута;	
			КонецЕсли;
			ОбработаноАтрибутов = ОбработаноАтрибутов + 1;
			Если ОбработаноАтрибутов > Лимит тогда
				прервать;
			КонецЕсли;
		КонецЕсли;		
		Если ф.ТипУзла = ТипУзлаXML.Текст и (ТипАтрибута = "v8:content") тогда
			НаименованиеРусское = ф.Значение;
			Если НаименованиеРусское <> "" тогда
				стрТЧ = Объект.Результат.Добавить();
				стрТЧ.ПутьКРеквизиту = ИмяАтрибутаСт;
				стрТЧ.НаименованиеРусское = НаименованиеРусское;
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;		
#КонецЕсли
КонецПроцедуры
